tnt310/STM32-E407-ETHERNET-MODBUS-MASTER/Src/modbus_mqtt_bridge.c
/* Built-in C library includes ---------------*/
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <param.h>
#include <stdlib.h>
/* Platform includes --------------------------*/
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "FreeRTOS.h"
#include "main.h"
#include "mqttclienttask.h"
#include "flash.h"
#include "rtc.h"
#include "usart.h"
#include "json.h"
#include "modbus_mqtt_bridge.h"
#include "mbproto.h"

/* Network includes----------------------------*/
#include "lwip/apps/mqtt.h"
#include "lwip/apps/mqtt_priv.h"
#include "lwip/ip4_addr.h"
#include "err.h"
#include "lwip.h"
#include "lwip/init.h"
#include "lwip/netif.h"

#include "command.h"
#include "http_client.h"
#include "param.h"
#include "time_value.h"
#include "telemetry.h"
#include "sdcard.h"
#include "fatfs.h"
/* Shared Variables --------------------------*/
extern osMessageQId xQueueDownlinkHandle;
extern osMessageQId xQueueUplinkHandle;
network_param_t netParam;
network_param_t mqttHostParam;
uint32_t 		mqtt_port;
uint32_t 		timeDelay; // timeout: 15s, 30s, 1p, 3p, 5p, 10p
uint32_t 		modbus_telemetry;
char *mqtt_id;
char *mqtt_user;
char *mqtt_password;
char *apikey;
uint16_t u16_mqtt_port;
char record[500];
FATFS fs;
FIL fil;
FRESULT fresult,fre;
/* Private Variables -------------------------*/
uint8_t mqtt_couter_err = 0;
char buffer[100];
char temp[20];
char temp0[10];
char temp1[20];
char temp2[30];
char temp3[20];
char ip_temp[20];
char netmask_temp[20];
char gateway_temp[20];
char broker_temp[20];
char Id[20];
char user[20];
char passwork[20];
char key[30];
char res[20];
char ftoastr[20];
uint32_t port0_baud,port0_stop,port0_databit,port0_parity;
uint32_t port1_baud,port1_stop,port1_databit,port1_parity;

uint8_t num_device;
static data1_t *ptr;
data1_t test;
data1_t *dynamic;
uint8_t id_temp[2];
uint8_t num_device;
/* Start implementation ----------------------*/

char *allocate(char *src)
{
	char *dst = pvPortMalloc(strlen(src)+1);
	strcpy(dst, src);
	return dst;
	}

static int jsoneq(const char *json, jsmntok_t *tok, const char *s) {
	if (tok->type == JSMN_STRING && (int) strlen(s) == tok->end - tok->start && strncmp(json + tok->start, s, tok->end - tok->start) == 0) {
		return 0;
	}
	return -1;
}

uint8_t parse_device_provision(char *Buffer, uint16_t BufferLen, uint8_t deviceID, uint16_t channelID, uint8_t channel_status)
{
	uint8_t tempID = 0;
	uint16_t tempchannelID = 0;
	char buffer[200];
	ptr = &test;
	int r;
	jsmn_parser p;
	jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
	jsmn_init(&p);
	r = jsmn_parse(&p, Buffer,BufferLen, t,sizeof(t) / sizeof(t[0]));
	for (uint8_t i = 1; i < r; i++) {
		if (jsoneq(Buffer, &t[i], "PORT") == 0) {
			ptr->channel = atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "ID") == 0) {
			tempID = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "FC") == 0) {
			ptr->func = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNEL") == 0) {
			memset(temp0,'\0',sizeof(temp0));
			strncpy(temp0,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			tempchannelID = (uint16_t)strtol(temp0, NULL, 0);
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICETYPE") == 0) {
			memset(temp,'\0',sizeof(temp));
			strncpy(temp,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceType = temp;
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICENAME") == 0) {
			memset(temp1,'\0',sizeof(temp));
			strncpy(temp1,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceName = temp1;
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNELTITLE") == 0) {
			memset(temp2,'\0',sizeof(temp2));
			strncpy(temp2,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->channeltitle = temp2;
			i++;
		}else if (jsoneq(Buffer, &t[i], "VALUETYPE") == 0) {
			memset(temp3,'\0',sizeof(temp3));
			strncpy(temp3,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->valueType= temp3;
			i++;
		}else if (jsoneq(Buffer, &t[i], "NUMREG") == 0) {
			ptr->numreg = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		}else if (jsoneq(Buffer, &t[i], "SCALE") == 0) {
			ptr->scale = (uint16_t)atoi(Buffer + t[i + 1].start);
			i++;
		}
	}
	if (tempID == deviceID && tempchannelID == channelID){
		ptr->devicestatus = channel_status;
		SD_Device(buffer,ptr->channel, deviceID,ptr->func,channelID,ptr->deviceType,ptr->channeltitle,ptr->deviceName,ptr->valueType,channel_status,ptr->scale, ptr->numreg);
		printf("\r\n buffer: %s\r\n",buffer);
		//return ptr;
	}else
		return 0;
}
/*-----------------------------------------PARSING DATA FROM SDCARD-----------------------------------------------------------------------------*/
void parse_sdcardInfo(char *Buffer, uint16_t BufferLen)
{
	int r;
	jsmn_parser p;
	jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
	jsmn_init(&p);
	r = jsmn_parse(&p, Buffer,BufferLen, t,sizeof(t) / sizeof(t[0]));
	for (uint8_t i = 0; i < r; i++){
		if (jsoneq(Buffer, &t[i], "network") == 0){
			//printf("\r\n - network: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			for (uint8_t j = i; j < r-1; j++){
				if (jsoneq(Buffer, &t[j], "ip") == 0){
					//printf("\r\n -ip: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char ip_temp[20];
					strncpy(ip_temp,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					ip4_addr_t ip;
					if (ipaddr_aton(ip_temp, &ip)) {
						netParam.ip.idata = ip.addr;
						//printf("\r\n New IP: %d %d %d %d", netParam.ip.cdata[0],netParam.ip.cdata[1], netParam.ip.cdata[2],netParam.ip.cdata[3]);
					}
					j++;
				}else if (jsoneq(Buffer, &t[j], "netmask") == 0){
					//printf("\r\n -netmask: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char netmask_temp[20];
					strncpy(netmask_temp,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					ip4_addr_t ip;
					if (ipaddr_aton(netmask_temp, &ip)) {
						netParam.netmask.idata = ip.addr;
						//printf("\r\n New Netmask: %d %d %d %d", netParam.netmask.cdata[0],netParam.netmask.cdata[1], netParam.netmask.cdata[2],netParam.netmask.cdata[3]);
					}
					j++;
				}else if (jsoneq(Buffer, &t[j], "gateway") == 0){
					//printf("\r\n -gateway: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char gateway_temp[20];
					strncpy(gateway_temp,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					ip4_addr_t ip;
					if (ipaddr_aton(gateway_temp, &ip)) {
						netParam.gateway.idata = ip.addr;
						//printf("\r\n New gateway: %d %d %d %d", netParam.gateway.cdata[0],netParam.gateway.cdata[1], netParam.gateway.cdata[2],netParam.gateway.cdata[3]);
					}
					j++;
				}else if (jsoneq(Buffer, &t[j], "broker") == 0){
					//printf("\r\n -broker: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char broker_temp[20];
					strncpy(broker_temp,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					ip4_addr_t ip;
					if (ipaddr_aton(broker_temp, &ip)) {
						mqttHostParam.ip.idata = ip.addr;
						//printf("\r\n New Broker IP: %d %d %d %d", mqttHostParam.ip.cdata[0],mqttHostParam.ip.cdata[1], mqttHostParam.ip.cdata[2],mqttHostParam.ip.cdata[3]);
					}
					j++;
				}
			}
			break;
		}else if (jsoneq(Buffer, &t[i], "mqtt") == 0){
			printf("\r\n - mqtt: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			for (uint8_t j = i; j < r-1; j++){
				if (jsoneq(Buffer, &t[j], "mqttId") == 0){
					//printf("\r\n -mqttId: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char Id[20];
					strncpy(Id,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					mqtt_id = Id;
					j++;
				}else if (jsoneq(Buffer, &t[j], "username") == 0){
					//printf("\r\n -username: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char user[20];
					strncpy(user,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					mqtt_user = user;
					j++;
				}else if (jsoneq(Buffer, &t[j], "pwd") == 0){
					//printf("\r\n -pwd: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char passwork[20];
					strncpy(passwork,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					mqtt_password = passwork;
					j++;
				}else if (jsoneq(Buffer, &t[j], "port") == 0){
					printf("\r\n -port: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					u16_mqtt_port= atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "apikey") == 0){
					//printf("\r\n -apikey: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					//char key[30];
					strncpy(key,Buffer + t[j + 1].start, t[j + 1].end - t[j + 1].start);
					apikey = key;
					j++;
				}
			}
			break;
		}else if (jsoneq(Buffer, &t[i], "rs232") == 0){
			printf("\r\n - rs232: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			for (uint8_t j = i; j < r-1; j++){
				if (jsoneq(Buffer, &t[j], "baud") == 0){
					//printf("\r\n -baud: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "databits") == 0){
					//printf("\r\n -databits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "stopbits") == 0){
					//printf("\r\n -stopbits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "parity") == 0){
					//printf("\r\n -parity: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					j++;
				}
			}
			break;
		}else if (jsoneq(Buffer, &t[i], "port0") == 0){
			printf("\r\n - port0: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			for (uint8_t j = i; j < r-1; j++){
				if (jsoneq(Buffer, &t[j], "baud") == 0){
					//printf("\r\n -baud: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port0_baud = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "databits") == 0){
					//printf("\r\n -databits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port0_databit = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "stopbits") == 0){
					//printf("\r\n -stopbits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port0_stop = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "parity") == 0){
					//printf("\r\n -parity: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port0_parity = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}
			}
			break;
		}else if (jsoneq(Buffer, &t[i], "port1") == 0){
			printf("\r\n - port1: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			for (uint8_t j = i; j < r-1; j++){
				if (jsoneq(Buffer, &t[j], "baud") == 0){
					//printf("\r\n -baud: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port1_baud = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "databits") == 0){
					//printf("\r\n -databits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port1_databit = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "stopbits") == 0){
					//printf("\r\n -stopbits: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port1_stop = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}else if (jsoneq(Buffer, &t[j], "parity") == 0){
					//printf("\r\n -parity: %.*s\r\n", t[j + 1].end - t[j + 1].start,Buffer + t[j + 1].start);
					port1_parity = (uint32_t)atoi(Buffer + t[j + 1].start);
					j++;
				}
			}
			break;
		}else if (jsoneq(Buffer, &t[i], "timeout") == 0){
			printf("\r\n - timeout: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			timeDelay = atoi(Buffer + t[i + 1].start);
			break;
		}else if (jsoneq(Buffer, &t[i], "telemetry") == 0){
			//printf("\r\n - timeout: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
			modbus_telemetry = atoi(Buffer + t[i + 1].start);
			break;
		}
	}
}

data1_t *parse_device(char *Buffer, uint16_t BufferLen)
{
	ptr = &test;
	int r;
	jsmn_parser p;
	jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
	jsmn_init(&p);
	r = jsmn_parse(&p, Buffer,BufferLen, t,sizeof(t) / sizeof(t[0]));
	for (uint8_t i = 1; i < r; i++) {
		if (jsoneq(Buffer, &t[i], "PORT") == 0) {
			ptr->channel = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "ID") == 0) {
			ptr->deviceID = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "FC") == 0) {
			ptr->func = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNEL") == 0) {
			memset(temp0,'\0',sizeof(temp0));
			strncpy(temp0,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceChannel = (uint16_t)strtol(temp0, NULL, 0);
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICETYPE") == 0) {
			memset(temp,'\0',sizeof(temp));
			strncpy(temp,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceType = temp;
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICENAME") == 0) {
			memset(temp1,'\0',sizeof(temp));
			strncpy(temp1,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceName = temp1;
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNELTITLE") == 0) {
			memset(temp2,'\0',sizeof(temp2));
			strncpy(temp2,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->channeltitle = temp2;
			i++;
		}else if (jsoneq(Buffer, &t[i], "VALUETYPE") == 0) {
			memset(temp3,'\0',sizeof(temp3));
			strncpy(temp3,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->valueType= temp3;
			i++;
		}else if (jsoneq(Buffer, &t[i], "NUMREG") == 0) {
			ptr->numreg = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		}else if (jsoneq(Buffer, &t[i], "SCALE") == 0) {
			ptr->scale = (uint16_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICESTATUS") == 0) {
			ptr->devicestatus = atoi(Buffer + t[i + 1].start);
			i++;
		}
	}
	return ptr;
}

void addDevice(data1_t *destination, data1_t *data)
{
   destination->channel = data->channel;
   destination->deviceID = data->deviceID;
   destination->func = data->func;
   destination->devicestatus = data->devicestatus;
   destination->numreg = data->numreg;
   destination->scale = data->scale;
   destination->deviceChannel = data->deviceChannel;
   destination->deviceType = allocate(data->deviceType);
   destination->deviceName = allocate(data->deviceName);
   destination->channeltitle = allocate(data->channeltitle);
   destination->valueType = allocate(data->valueType);
}

/*---------------------------------------------------MODBUS MQTT BRIGDE FUNCTION-----------------------------------------------------------------------------*/
static void mqtt_bridge_pub_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish telemetry result: %d\n", result);
	} else {
	}
}
static void mqtt_bridge_provision_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish provision result: %d\n", result);
	} else {
	}
}
static void mqtt_bridge_command_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish command result: %d\n", result);
	} else {
	}
}
/*----------------------------------------------------UP/DOWNLINK FUNCTION--------------------------------------------------------------------------*/
void mqtt_modbus_thread_up(mqtt_client_t *client, char *pub_topic, char* pro_topic, char* command_topic) {

