tnt310/STM32-E407-ETHERNET-MODBUS-MASTER/Src/modbus_mqtt_bridge.c
	uint8_t time[6];
	static uint8_t counter = 0;
	static uint8_t telemetry = 0;
	BaseType_t Err = pdFALSE;
	xQueueMbMqtt_t xQueueMbMqtt;
	portCHAR head[MAX_JSON_LEN];
	portCHAR tail[MAX_JSON_LEN];
	portCHAR jsontemp[TEMP_JSON_LEN];
	portCHAR jsontempv1[TEMP_JSON_LEN];
	memset(head,'\0',sizeof(head));
	memset(tail,'\0',sizeof(tail));
	static uint8_t count = 0;
	err_t err;
	while (1) {
		Err = xQueueReceive(xQueueUplinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME*3);
		if (Err == pdPASS) {
			if (xQueueMbMqtt.gotflagProvision == 1 && xQueueMbMqtt.sum_dev != 0)  // check provision ?
				{
					err_t err;
					uint8_t SUM = xQueueMbMqtt.sum_dev;
				    for (uint8_t i = 0; i < SUM; i++)// duyệt từng phần tử trong mảng
				    {
				        for (uint8_t j = 0; j < SUM; j++)  // duyệt ID device
				        {
				            if ((dynamic+j)->deviceID == (dynamic+i)->deviceID && (dynamic+i)->deviceID != (dynamic+i-1)->deviceID){
				                    count ++;
				                    if (count == 1){
				                        if (i > 0){
				                        for (uint8_t a = 0; a < i; a++){
				                             if ((dynamic+a)->deviceID == (dynamic+j)->deviceID){
				                                goto TEST;
				                                }
				                            }
				                        }
				                        head_provision(head,(dynamic+j)->deviceID,(dynamic+j)->deviceName,(dynamic+j)->deviceType);
				                        for (uint8_t z = 0; z < SUM; z++)  // duyệt channel ID
				                        {
				                            if ((dynamic+z)->deviceID == (dynamic+j)->deviceID){
				                            	tail_provision(tail,(dynamic+z)->deviceChannel,(dynamic+z)->channeltitle,(dynamic+z)->valueType, (dynamic+z)->func);
				                                strcat(head,tail);
				                            }
				                        }
				                        head[strlen(head) - 1] = '\0';
				                        strcat(head,"]}]}");
				                        err = mqtt_publish(client,pro_topic, head,strlen(head), QOS_0, 0,mqtt_bridge_provision_request_cb,NULL);
				                        memset(head,'\0',sizeof(head));
										if (err != ERR_OK) {
											printf("\r\n Publish Provision err: %d\n", err);
											}
										osDelay(200);
				                    }
				            }
				        }
				        TEST: count = 0;
				    }
					BaseType_t er = pdFALSE;
					er = xQueueSend(xQueueDownlinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME);
					if (er == pdPASS) {
					}
				}/* --------------END OF SENDING PROVISION---------------------------------------------------------------------*/
			else if (xQueueMbMqtt.gotflagcommand == 3){  // check command
				if (xQueueMbMqtt.FunC == 3){
					if (xQueueMbMqtt.flag32 == 1){
						xQueueMbMqtt.flag32 = 0;
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.RegData32.i32data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
					}else{
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.RegData.i16data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
					}
				}
				else if (xQueueMbMqtt.FunC == 6)
					command_write_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data);
				err = mqtt_publish(client,command_topic, head,strlen(head), QOS_0, 0,mqtt_bridge_command_request_cb,NULL);
				if (err != ERR_OK) {
					printf("\r\n Publish command err: %d\n", err);
					}
				else if (err == ERR_OK){
					xQueueMbMqtt.gotflagcommand = 0;
				}
			}/* --------------END OF SENDING COMAMND RESPONSE----------------------------------------------*/
			else if (xQueueMbMqtt.gotflagLast == 1){ // send record data
				MX_FATFS_Init();
				fresult = f_mount(&fs, "/", 1);
				fresult = f_open(&fil,"record.txt", FA_READ);
				for (uint8_t i= 0; (f_eof(&fil) == 0); i++)
					{
						memset(head,'\0',sizeof(head));
						f_gets((char*)head, sizeof(head), &fil);
						head[strlen(head)-1] = '\0';
						HAL_Delay(200);
						//printf("\r\n Telemetry buffer: %s\r\n",record);
						err = mqtt_publish(client, pub_topic,head,strlen(head), QOS_0, 0,mqtt_bridge_pub_request_cb,NULL);
						if (err != ERR_OK){
							printf("\r\n Publish record fail with err: %d", err);
						}
					}
				//f_unlink(file);
				//f_rename("temp.txt",file);
				fresult = f_close(&fil);
			}
			else if (xQueueMbMqtt.gotflagLast == 2) {
				getTime(time);
				timestamp_telemetry(head,time);
				tail[strlen(tail) - 1] = '\0';
				strcat(tail,"}}}");
				strcat(head,tail);
				err = mqtt_publish(client, pub_topic,head,strlen(head), QOS_0, 0,mqtt_bridge_pub_request_cb,NULL);
				if (err != ERR_OK) {
					printf("\r\n Publish err: %d\n", err);
					if (err == -11){
						//strcat(head,"\n");
						//RecordData("record.txt",head);// write data to record.txt
						//MX_LWIP_Init();
					}else if (err == -1){
						//strcat(head,"\n");
						//RecordData("record.txt",head);// write data to record.txt
						// do something for err : out of memory
					}
					memset(head,'\0',sizeof(head));
					memset(tail,'\0',sizeof(tail));
					counter = 0;
				}
				memset(head,'\0',sizeof(head));
				memset(tail,'\0',sizeof(tail));
				counter = 0;
			}
			else if (xQueueMbMqtt.gotflagtelemetry == 2) {
				if (xQueueMbMqtt.flag32 == 1){
					xQueueMbMqtt.flag32 = 0;
				    memset(res,'\0',sizeof(res));
				    memset(ftoastr,'\0',sizeof(ftoastr));
					sprintf(res,"%d",xQueueMbMqtt.RegData32.i32data);
					ftoa(ftoastr, res, xQueueMbMqtt.scale);
					printf("\r\nTelemetry data reg32: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
				}else{
				    memset(res,'\0',sizeof(res));
				    memset(ftoastr,'\0',sizeof(ftoastr));
					sprintf(res,"%d",xQueueMbMqtt.RegData.i16data);
					ftoa(ftoastr, res, xQueueMbMqtt.scale);
					printf("\r\nTelemetry data reg16: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
				}
			counter ++;
			if (counter == 1) {
				id_temp[0] = xQueueMbMqtt.NodeID;
				head_telemetry(jsontemp, xQueueMbMqtt.NodeID);
				strcat(tail,jsontemp);
				if (telemetry == 1){
					strcat(tail,jsontempv1);
					telemetry = 0;
				}
				//tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data, xQueueMbMqtt.RegData.i16data);
				tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data, ftoastr);
				strcat(tail,jsontemp);
			}
			if (counter > 1){
				id_temp[1] = xQueueMbMqtt.NodeID;
				if (id_temp[0] == id_temp[1]) {
					//tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data, xQueueMbMqtt.RegData.i16data);
					tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data,ftoastr);
					strcat(tail,jsontemp);
				}
				else if (id_temp[0] != id_temp[1]){
					telemetry = 1;
					counter = 0;
					//tail_telemetry(jsontempv1,xQueueMbMqtt.RegAdr.i16data, xQueueMbMqtt.RegData.i16data);
					tail_telemetry(jsontempv1,xQueueMbMqtt.RegAdr.i16data, ftoastr);
					tail[strlen(tail) - 1] = '\0';
					strcat(tail,"},");
				}
			}
		}/* --------------END OF SENDING TELEMETRY--------------------------------------------------------------------*/
	} else {
			/*Create Json and publish to mqtt */
//			memset(publish_buffer, 0, MAX_JSON_LEN);
//			strcat(publish_buffer, "{\"NodeID\":");
//			strcat(publish_buffer, itoa_user(0, 10));
//			strcat(publish_, ",\"FunC\":");
//			strcat(publish_buffer, itoa_user(MB_FUNC_ACK, 10));
//			strcat(publish_buffer, ",\"RegAdrH\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegAdr.i8data[1], 10));
//			strcat(publish_buffer, ",\"RegAdrL\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegAdr.i8data[0], 10));
//			strcat(publish_buffer, ",\"RegDataH\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegData.i8data[1], 10));
//			strcat(publish_buffer, ",\"RegDataL\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegData.i8data[0], 10));
//			strcat(publish_buffer, ",\"PortID\":");
//			strcat(publish_buffer, itoa_user(xQueueMbMQtt.PortID, 10));
//			strcat(publish_buffer, "}");
////			HAL_UART_Transmit(&huart1, publish_buffer, MAX_JSON_LEN, 1000);
//			err = mqtt_publish(client, pub_topic, publish_buffer,
//					strlen(publish_buffer), QOS_0, 0,
//					mqtt_bridge_pub_request_cb,
//					NULL);
//			if (err != ERR_OK) {
//				mqtt_couter_err++;
//
//				printf("\r\n Publish err: %d\n", err);
//				if (mqtt_couter_err == 10) NVIC_SystemReset();
//			}
//			else
//			{
//				mqtt_couter_err = 0;
//			}

